PeterVranken/TRK-USB-MPC5643L/LSM/printf-VLE/code/serial/sio_serialIO.c
/*
 * Function implementation
 */

/**
 * Initialize the external pin mapping. If LINFlexD_0 is configured then the LINFlexD
 * device can be used without additional hardware or wiring for the serial communication
 * with the openSDA chip on the TRK-USB-MPC5643L evaluation board.\n
 *   Additional wiring is required for LINFlexD_1. The ports PD9/12 are used for TX, RX,
 * respectively.\n
 *   Other pin mappings are not supported. Usually there is more than one choices per
 * LINFlexD device. If the code is run on another board it depends which pins to be used.
 * This cannot be anticipated by the code offered here.
 */
static void configSIULForUseWithOpenSDA(void)
{
    /* Configure SIUL. Specify for the affected MCU pins, which function they have. We
       connect the RX and TX ports of the LINFlex_0 device with the MCU pins, that are
       connected to the USB-to-serial chip. The possible connections are (MCU ref. manual,
       table 3-5, p. 95ff):
       LINFlexD_0, TX: PB2
       LINFlexD_0, RX: PB3, PB7
       LINFlexD_1, TX: PD9, PF14
       LINFlexD_1, RX: PB13, PD12, PF15 */

    /* Principal register PCR of SIUL:
       SMC: irrelevant, 0x4000
       APC: digital pin use, 0x2000 = 0
       PA, 0xc00: output source select, n means ALTn, n=0 is GPIO
       OBE, 0x200: relevant only for ALTn!=0, better to set =0 otherwise
       IBE: input buffer, relevance unclear, 0x100=0 (off)/1 (on)
       ODE: Open drain, 0x20=0 (push/pull), 1 means OD
       SRC: Slew rate, 0x4=1 (fastest), 0 means slowest
       WPE: "weak pull-up", meaning unclear, 0x2=0 (off)
       WPS: Pull-up/down, irrelevant 0x1=1 (up)/0 (down) */
    if(IDX_LINFLEX_D == 0)
    {
        /* We connect the pair PB2/3, which is connected to the USB to serial converter
           MC9S08JM60CLD on the evaluation board. This permits direct connection to the RS
           232 through a virtual COM port visible on the host machine.
             We choose:
           TX: PA=1=0x400, OBE=0=0, IBE=0=0, ODE=0=0, SRC=1=0x4, WPE=0=0 => 0x404
           RX: PA=0=0, OBE=0=0, IBE=1=0x100 => 0x100 */
        SIU.PCR[18].R = 0x0404;     /* Configure pad PB2, TX, for ALT1: LINFlexD_0, TXD */
        SIU.PCR[19].R = 0x0100;     /* Configure pad PB3 for LINFlexD_0, RXD */
    }
    else
    {
        assert(IDX_LINFLEX_D == 1);
        
        /* We connect to the pair PD9/12, which is connected to the tower extension bus of
           the evaluation board. Using this pin pair requires additional, external wiring.
             We choose:
           TX: PA=2=0x800, OBE=0=0, IBE=0=0, ODE=0=0, SRC=1=0x4, WPE=0=0 => 0x804
           RX: PA=0=0, OBE=0=0, IBE=1=0x100 => 0x100 */
        SIU.PCR[57].R = 0x0804;     /* Configure pad PD9, TX, for ALT2: LINFlexD_1, TXD */
        SIU.PCR[60].R = 0x0100;     /* Configure pad PD12 for LINFlexD_0, RXD */
    }

    /* PSMI: Input select. */
    SIU.PSMI31.B.PADSEL = 0;    /* PSMI[31]=0 connects pin B3 with LINFlexD_0 RX. */

} /* End of configSIULForUseWithOpenSDA */



/**
 * Initialize the DMA device. The chosen channel is set up to write the contents of a
 * cyclic buffer of fixed address and size into the UART.
 *   @remark
 * The DMA initialization is mostly related to the DMA channel in use (which is considered
 * globally reserved for this purpose). However, this function accesses some DMA registers,
 * too, that affect all channels (e.g. channel arbitration). This function will require
 * changes, when the module is integrated into an environment, where different DMA channels
 * are applied for different, unrelated purposes.
 */
static void configDMA(void)
{
    /* Check preconditions for use of DMA with modulo source addressing. If this assert
       fires it may point to a inconsistency between the C source code and the linker
       control file, which provides the address of the buffer. */
    assert(((uintptr_t)_serialOutRingBuf & SERIAL_OUTPUT_RING_BUFFER_IDX_MASK) == 0);

    /* The linker script is required to provide a properly aligned buffer without risking
       to loose lots of RAM because of the alignment. Therefore, the linker script itself
       has a constant for the size of the buffer. We need to double check the consistency
       of linker configuration with C code. */
    extern uint8_t ld_noBitsDmaRingBuffer[0] ATTRIB_DBG_ONLY;
    assert((uintptr_t)ld_noBitsDmaRingBuffer == SERIAL_OUTPUT_RING_BUFFER_SIZE_PWR_OF_TWO);

    /* Initialize write to ring buffer. */
    _serialOutRingBufIdxWrM = 0;
    
    /* Initial load address of source data is the beginning of the ring buffer. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD0_.B.SADDR =
                                    (vuint32_t)&_serialOutRingBuf[_serialOutRingBufIdxWrM];
    /* Read 1 byte per transfer. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD4_.B.SSIZE = 0;
    /* After transfer, add 1 to the source address. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD4_.B.SOFF = 1;
    /* After major loop, do not move the source pointer. Next transfer will read from next
       cyclic address. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD12_.B.SLAST = 0;
    /* Source modulo feature is applied to implement the ring buffer. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD4_.B.SMOD =
                                                SERIAL_OUTPUT_RING_BUFFER_SIZE_PWR_OF_TWO;

    /* Load address of destination is fixed. It is the byte input of the UART's FIFO. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD16_.B.DADDR =
                                                        ((vuint32_t)&LINFLEX.BDRL.R) + 3;
    /* Write 1 byte per transfer. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD4_.B.DSIZE = 0;
    /* After transfer, do not alter the destination address. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD20_.B.DOFF = 0;
    /* After major loop, do not alter the destination address. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD24_.B.DLAST_SGA = 0;
    /* Destination modulo feature is not used. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD4_.B.DMOD = 0;

    /* Transfer 1 byte per minor loop */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD8_.B.SMLOE = 0;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD8_.B.DMLOE = 0;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD8_.B.MLOFF = 0;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD8_.B.NBYTES = 1;

    /* Initialize the begining and current major loop iteration counts to zero. We will set
       it in the next call of sio_writeSerial. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.BITER = 0;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD20_.B.CITER = 0;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD20_.B.CITER_LINKCH = 0;

    /* Do a single transfer; don't repeat, don't link to other channels. 1: Do once, 0:
       Continue by repeating all */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.D_REQ = 1;
    
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.INT_HALF = 0;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.INT_MAJ = 0;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD20_.B.CITER_E_LINK = 0;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.BITER_E_LINK = 0;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.MAJOR_E_LINK = 0;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.E_SG = 0;
    
    /* 0: No stalling, 3: Stall for 8 cycles after each byte; fast enough for serial com. */
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.BWC = 3;
    
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.START = 0;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.DONE = 0;
    EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.ACTIVE = 0;

    /* ERCA, 0x4: 1: Round robin for channel arbitration, 0: Priority controlled
       EDBG, 0x2: 1: Halt DMA when entering the debugger.
         Note, this setting affects all channels! */
    EDMA.DMACR.R = 0x2;

    /* We use priority controlled channel arbitration. All active channels need to have
       different priorities. The standard configuration is to set the priority to the
       channel number. This is the reset default of the hardware and we are not going to
       change it. The reset default disables preemptability or all channels.
         Note, this configuration affects all channels! */
#if 0
    unsigned int idxChn;
    for(idxChn=0; idxChn<16; ++idxChn)
    {
        /* ECP, 0x80: 1: Channel can be preempted, 0: cannot be preempted
           DPA, 0x40: 0: Channel can preempt, 1: cannot preempt others */
        EDMA.DCHPRI[idxChn].R = idxChn;
    }
#endif

    /* EDMA.DMAERQL.R: Not touched yet, we don't enable the channel yet. This will be done in
       the next use of sio_writeSerial. */
    
