PeterVranken/TRK-USB-MPC5643L/LSM/printf-VLE/code/serial/sio_serialIO.c
    /* Route LINFlex TX DMA request to eDMA channel DMA_CHN_FOR_SERIAL_OUTPUT.
         ENBL, 0x80: Enable channel
         SOURCE, 0x3f: Selection of DMAMUX input. The devices are hardwired to the DMAMUX
       and the index of a specific device can be found in table 18-4, MCU ref. manual, p.
       388. Index 22: LINFlexD_0, Tx, index 24: LINFlexD_1, Tx */
    DMAMUX.CHCONFIG[DMA_CHN_FOR_SERIAL_OUTPUT].R |= (0x80 + 22 + 2*IDX_LINFLEX_D);

} /* End of configDMA */




/**
 * Initialization of the MPC5643L's I/O device LINFlex_0. The device is put into UART mode
 * for serial in-/output.
 *   @param baudRate
 * The Baud rate in Hz. Allow values range from 10 .. 1000000, proven values range from 300
 * till 115200 Hz. ("Proven" relates to the TRK-USB-MPC6543L connected to a Windows host
 * through openSDA and USB.)
 *   @remark
 * To match the correct Baud rates the code assumes a peripheral clock rate of 120 MHz.
 */
static void configLINFlex(unsigned int baudRate)
{
    /* Avoid over-/underflow down below. */
    if(baudRate < 10)
        baudRate = 10;
    else if(baudRate > 1000000)
        baudRate = 1000000;
    
    /* Please find the UART register description in the MCU ref. manual, section 30.10, p.
       979ff. */

    /* Enter INIT mode. This is a prerequisite to access the other registers.
       INIT, 0x1: 1 init mode, 0 normal operation or sleep
       SLEEP, 0x2: 1 sleep mode, 0: normal operation */
    LINFLEX.LINCR1.R = 0x1;

    /* Wait for acknowledge of the INIT mode. */
    while((LINFLEX.LINSR.R & 0xf000) != 0x1000 /* initialization mode*/)
    {}

    /* Configure the LINFlex to operate in UART mode
       UART, 0x1: 0 for UART, 1 for LIN
         The UART bit is set prior to other bits in the same register in
       order to become able to write the other configuration bits. */
    LINFLEX.UARTCR.R = 0x0001;

    /* RDFLRFC, 0x1c00: (no bytes to receive - 1) in buffer mode or read FIFO fill amount
       RFBM: RX buffer/FIFO mode, 0x200, 0 means buffer, 1 FIFO mode
       TFBM: TX buffer/FIFO mode, 0x100, 0 means buffer, 1 FIFO mode
       PCE: Parity enable, 0x4, 0 means off
       WL: Word length, 0x80+0x2, value b01 means data 8 Bit
       RX, TX enable, 0x20 and 0x10, respectively (Can be set after leaving the init mode.) */
    LINFLEX.UARTCR.R = 0x0133; /* TX FIFO mode, RX buffer mode, 8bit data, no parity, Tx
                                    enabled, UART mode stays set */

    /// @todo It's unclear if it is always required to use channel 0 in UART mode.
    LINFLEX.DMATXE.R = 0x1; /* Enable DMA TX channel. */

    /* Configure baudrate:
       fsys is 120 MHz (peripheral clock).
       LFDIV = fsys / (16 * desired baudrate)
       LINIBRR.IBR = integer part of LFDIV
       LINFBRR.FBR = 16 * fractional part of LFDIV (after decimal point)

       Example:
       LFDIV = 120e6/(16*19200) = 390.625
       LINIBRR.IBR = 390
       LINFBRR.FBR = 16*0.625 = 10 
       
       390:10 19200 bd, 65:2 115200 bd, 58:10 128000 bd, 29:5 256000 bd, 8:2 921600 bd
       
        19200 bd worked well with terminal.exe and putty
       115200 bd worked well with terminal.exe and putty
       128000 bd showed transmission errors with terminal.exe and putty
       256000 bd failed with terminal.exe and putty
       921600 bd failed with terminal.exe (not tried with putty) */
    const unsigned long IBR = 7500000ul / baudRate
                      , FBR = (7500000ul - IBR*baudRate)*16 / baudRate;
    assert((IBR & ~0xffffful) == 0  &&  (FBR & ~0xful) == 0);
    LINFLEX.LINIBRR.B.IBR = IBR;
    LINFLEX.LINFBRR.B.FBR = FBR;

    /* Clear all possibly pending status bits by w2c access. RM 30.10.6, p. 992. */
    LINFLEX.UARTSR.R = 0x0000ffafu;

#define USE_FIELD_ALIASES_LINFLEX xxx

    /* LINIER: Interrupt enable. The bits relate to the bits of same name in LINESR (error
       bits), LINSR and UARTSR (both status).
         BOIE: Buffer overrun could be read in handling of DBFIE
         DBFIE: should report FIFO full in reception mode
         DBEIETOIE: Should request new data for TX, UARTSR[TO] needs to be set
         DRIE: Interrupt on byte received, DRF set in UARTSR
         DTIE: Interrupt on byte sent, DTF set in UARTSR */
    LINFLEX.LINIER.B.DRIE = 1;
    
    /* GCR
       STOP: 0 for 1 or 1 for 2 stop bits
       SR: set 1 to reset counters, buffers and FIFO but keep configuration and operation */

    /* Enter normal mode again. */
    LINFLEX.LINCR1.R = 0x0; /* INIT, 0x1: 0, back to normal operation */
    
    /* According to RM 30.10.3 we would expect LINSR.LINS transit to 2, to indicate the idle
       state. However, the following loop is endless, LINS changes from 1 (initialization
       mode) to 0 (sleep mode) and remains there. Nonetheless, the UART is worimg well. */
    //while((LINFLEX.LINSR.R & 0xf000) != 0x2000 /* idle */){}

} /* End of configLINFlex */




/**
 * Interrupt handler for UART RX event. A received character is read from the UART hardware
 * and put into our ring buffer if there's space left. Otherwise the character is counted
 * as lost without further remedial action.
 */
static void linFlexRxInterrupt(void)
{
    /* Get the received byte. */
    /// @todo Record a buffer overrun bit in case the IRQ handler comes too slow
    const unsigned char c = LINFLEX.BDRM.B.DATA4;
    
#ifdef DEBUG
    ++ sio_serialInNoRxBytes;
#endif

    /* To support different terminal characteristics, one character can be configured to
       be silently ignored in the input stream. This shall normally be the linefeed
       character. */
#if SERIAL_INPUT_FILTERED_CHAR != 0
    if(c != SERIAL_INPUT_FILTERED_CHAR)
#endif
    {
        /* Check for buffer full. Compute next write position at the same time. */
        volatile uint8_t * const pWrTmp = _pWrSerialInRingBuf
                       , * const pWrNext = pWrTmp < _pEndSerialInRingBuf? pWrTmp+1
                                                                        : &_serialInRingBuf[0];

        /* Put the byte into our buffer if there's enough room. */
        if(pWrNext != _pRdSerialInRingBuf)
        {
            *pWrTmp = c;
        
