PeterVranken/TRK-USB-MPC5643L/LSM/printf-VLE/code/serial/sio_serialIO.c
            /* Count the received end of line characters. (The variable is decremented on
               consumption of such a character.) */
            if(c == SERIAL_INPUT_EOL)
                ++ _serialInNoEOL;

            /* Update write position into ring buffer. This is at the same time the indication
               of the availability of the new character to the application API functions. */
            _pWrSerialInRingBuf = pWrNext;
        }
        else    
        {
            /* Buffer overrun, count lost character. */
            ++ sio_serialInLostBytes;
        }
    
        /* Ensure that all relevant memory changes are visible before we leave the
           interrupt. */
        atomic_thread_fence(memory_order_seq_cst);
        
    } /* End if(Character discarded?) */

    /* Acknowlege the interrupt by w2c and enable the next one at the same time. */
    assert((LINFLEX.UARTSR.R & 0x4) != 0);
    LINFLEX.UARTSR.R = 0x4;  
    
} /* End of linFlexRxInterrupt */



/**
 * Our locally implemented interrupt handlers are registered at the operating system for
 * serving the required I/O devices (DMA and LINFlex 0 or 1).
 */
static void registerInterrupts(void)
{
/* Interrupt offsets taken from MCU reference manual, p. 936. The DMA interrupts for the
   different channels start with 11, e.g. 26 for DMA channel 15. */
#define IDX_LINFLEX_RX_IRQ  (79 + 20*IDX_LINFLEX_D)

    /* Register our IRQ handler. */
    ihw_installINTCInterruptHandler( &linFlexRxInterrupt
                                   , /* vectorNum */ IDX_LINFLEX_RX_IRQ
                                   , /* psrPriority */ INTC_PRIO_IRQ_UART_FOR_SERIAL_INPUT
                                   , /* isPreemptable */ true
                                   );
#undef IDX_LINFLEX_RX_IRQ
} /* End of registerInterrupts */



/**
 * Initialize the I/O devices for serial output, in particular, these are the LINFlex
 * device plus a DMA channel to serve it.
 *   @param baudRate
 * The Baud rate of in- and output in Hz. Allow values range from 10 .. 1000000, proven
 * values range from 300 till 115200 Hz.
 *   @remark
 * This function needs to be called at system initialization phase, when all External
 * Interrupts are still suspended.
 */
void sio_initSerialInterface(unsigned int baudRate)
{
    /* Connect the LINFlexD device with the external MCU pins.
         If LINFlexD_0 is configured on the evaluation board TRK-USB-MPC5643L, then
       communication with the host computer via the openSDA chip and the USB connection
       becomes possible. */
    configSIULForUseWithOpenSDA();
    
    /* Configure the LINFlex device for serial in- and output. */
    configLINFlex(baudRate);

    /* Register the interrupt handler serial RX. */
    registerInterrupts();
    
    /* Initialize DMA for writing into the UART. */
    configDMA();

    /* Empty receive buffer. */
    _pWrSerialInRingBuf =
    _pRdSerialInRingBuf = &_serialInRingBuf[0];
    
} /* End of sio_initSerialInterface */



/** 
 * Principal API function for data output. A byte string is sent through the serial
 * interface. Actually, the bytes are queued for sending and the function is
 * non-blocking.\n
 *   The function can be called from any context. However, it must not be
 * called untill function sio_initSerialInterface() has completed.
 *   @return
 * The number of queued bytes is returned. Normally, this is the same value as argument \a
 * noBytes. However, the byte sequence can be longer than the currently available space in
 * the send buffer. (Its size is fixed and no reallocation strategy is implemented.) The
 * tranmitted message will be truncated if the return value is less than function argument
 * \a noBytes.
 *   @param msg
 * The byte sequence to send. Note, this may be but is not necessarily a C string with zero
 * terminations. Zero bytes can be send, too.
 *   @param noBytes
 * The number of bytes to send. For a C string, this will mostly be \a strlen(msg).
 */
unsigned int sio_writeSerial(const char *msg, unsigned int noBytes)
{
    uint32_t msr = ihw_enterCriticalSection();
    {
        /* Stop the (possibly) running DMA channel.
            See 19.2.1.15 and RM of MPC5748G, 70.5.8.1: Coherently stop a DMA channel with
           the ability of resuming it later. */
        while((EDMA.DMAHRSL.R & (0x1<<DMA_CHN_FOR_SERIAL_OUTPUT)) != 0)
        {}
        EDMA.DMACERQ.R = DMA_CHN_FOR_SERIAL_OUTPUT;

        /* Note, most buffer addresses or indexes in this section of the code are
           understood as cylic, i.e. modulo the buffer size. This is indicated by an M as
           last character of the affectzed symbols but not mentioned again in the code
           comments. */
#define MODULO(bufIdx)    ((bufIdx) & SERIAL_OUTPUT_RING_BUFFER_IDX_MASK)

        /* The current, i.e. next, transfer address of the DMA is the first (cyclic)
           address, which we must not touch when filling the buffer. This is the (current)
           end of the free buffer area. */
        const uint32_t idxEndOfFreeSpaceM =
                                EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD0_.B.SADDR;
        
        /* The cyclic character of the buffer can require one or two copy operations to
           place the message. We compute the concrete index ranges to copy.
             Note the -1: Same index values are used as empty-buffer-indication. Therefore
           it is not possible to entirely fill the buffer. */
        const unsigned int noBytesFree =
                                MODULO(idxEndOfFreeSpaceM - _serialOutRingBufIdxWrM - 1);
         
        /* Avoid buffer overrun by saturation of the user demand and report the number of
           overrun events and the number of lost message characters. */
        if(noBytes > noBytesFree)
        {
            ++ sio_serialOutNoTruncatedMsgs;
            sio_serialOutNoLostMsgBytes += noBytes - noBytesFree;
            noBytes = noBytesFree;
        }
        
        /* How many bytes would fit until we have to wrap? This limits the first copy
           operation. */
        const unsigned int noBytesTillEnd = MODULO(- _serialOutRingBufIdxWrM);
        unsigned int noBytesAtEnd;
        if(noBytes <= noBytesTillEnd)
        {
            /* The message fits into the rest of the linear buffer, no wrapping required. */
            noBytesAtEnd = noBytes;
        }
        else
        {
            /* A portion of the message is placed at the end of the linear buffer and the
               rest of the message at its beginning. */
            noBytesAtEnd = noBytesTillEnd;
        }
               
        /* Always copy the first part of the message to the current end of the linear
           buffer. */
        uint8_t * const pDest = &_serialOutRingBuf[MODULO(_serialOutRingBufIdxWrM)];
        assert(pDest + noBytesAtEnd <= &_serialOutRingBuf[SERIAL_OUTPUT_RING_BUFFER_SIZE]);
        memcpy(pDest, msg, noBytesAtEnd);
        
        /* Copy the second part of the message at the beginning of the linear buffer if
           there is a remainder. */
        if(noBytes > noBytesAtEnd)
        {
            assert(noBytes - noBytesAtEnd < sizeof(_serialOutRingBuf));
            memcpy(&_serialOutRingBuf[0], msg+noBytesAtEnd, noBytes-noBytesAtEnd);
        }           
        
        /* Apply a memory barrier to ensure that all data is in memory before we (re-)start
           the DMA transfer. */
        atomic_thread_fence(memory_order_seq_cst);

        _serialOutRingBufIdxWrM = _serialOutRingBufIdxWrM + noBytes;

        /* Start DMA. We can do this unconditionally because we have filtered the special
           situation of not writing any new character. */
        const uint32_t noBytesPending = MODULO(_serialOutRingBufIdxWrM - idxEndOfFreeSpaceM);
        assert(noBytesPending > 0);
    
        /* Set the number of bytes to transfer to the UART by DMA.
             Note, here we have a problem with the NXP support file MPC5643L.h. The
           same value needs to be written to the two fields CITER and BITER of the
           Transfer Control Words 5 and 7, respectively. These fields are defined
           conditionally, depending on the channel-to-channel linking bit e_link - they
           have either 9 or 15 Bit. This could be mapped by a support file e.g. in form
           of a union, which allows both variants. Unfortunately, MPC5643L.h defines
           CITER and BITER unconditionally but differently. We use the 15 Bit length and
           may use MPC5643L.h to access BITER but must not use the support file to
           access CITER. */
        assert((unsigned)noBytesPending <= SERIAL_OUTPUT_RING_BUFFER_SIZE-1);
        EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD28_.B.BITER = noBytesPending;
        //EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD20_.B.CITER = noBytesPending;
        const uint16_t doff = 0;
        EDMA.CHANNEL[DMA_CHN_FOR_SERIAL_OUTPUT].TCDWORD20_.R =
                                                    ((noBytesPending & 0x7fff) << 16) | doff;

        /* Enable the DMA channel to accept the UART's requests for bytes. This
           initiates or resumes the DMA transfer.
             NOP, 0x80: 1: Ignore write to register (to permit 32 Bit access to more
           than one of these byte registers at a time)
             SERQ, 0x40: 0: Address channel with SERQ, 1: Enable all channels
             SERQ, 0xf: Channel number */
        EDMA.DMASERQ.R = DMA_CHN_FOR_SERIAL_OUTPUT;
        ++ sio_serialOutNoDMATransfers;

#undef MODULO
    }
    ihw_leaveCriticalSection(msr);
    
    return noBytes;
    
