PeterVranken/TRK-USB-MPC5643L/LSM/printf-VLE/code/serial/sio_serialIO.c
} /* End of sio_writeSerial */




/**
 * Application API function to read a single character from serial input or EOF if there's
 * no such character received meanwhile.
 *   @return
 * The function is non-blocking. If the receive buffer currently contains no character it
 * returns EOF (-1). Otherwise it returns the earliest received character, which is still
 * in the buffer.
 *   @remark
 * The return of EOF does not mean that the stream has been closed. It's just a matter of
 * having no input data temporarily. On reception of the more characters the function will
 * continue to return them.
 */
signed int sio_getChar(void)
{
    signed int c;
    
    /* Reading the ring buffer is done in a critical section to ensure mutual exclusion
       with the it filling interrupt. */
    uint32_t msr = ihw_enterCriticalSection();
    {
        /* Check for buffer empty. */
        if(_pRdSerialInRingBuf != _pWrSerialInRingBuf)
        {
            c = *_pRdSerialInRingBuf;

            /* Keep track of the received but not yet consumed end of line characters. (The
               variable is incremented on reception of such a character.) */
            if(c == SERIAL_INPUT_EOL)
            {
                assert(_serialInNoEOL > 0);
                -- _serialInNoEOL;
            }

            /* Update read position in the ring buffer. This is at the same time the indication
               towards the interrupt of having the character consumed. */
            volatile uint8_t * const pRdTmp = _pRdSerialInRingBuf;
            _pRdSerialInRingBuf = pRdTmp < _pEndSerialInRingBuf ? pRdTmp+1 
                                                                : &_serialInRingBuf[0];
        }
        else    
        {
            /* Nothing in buffer, return EOF. */
            c = -1;
        }
    }
    ihw_leaveCriticalSection(msr);

    return c;

} /* End of sio_getChar */




/**
 * The function reads a line of text from serial in and stores it into the string pointed
 * to by \a str. It stops when the end of line character is read and returns an
 * empty string if no such character has been received since system start or the previous
 * call of this function.\n
 *   Note, the latter condition means that the function is non-blocking - it doesn't wait
 * for further serial input.\n
 *   The end of line character, if found, is not copied into \a str. A terminating zero
 * character is automatically appended after the characters copied to \a str.\n
 *   The end of line character is a part of this module's compile time configuration, see
 * #SERIAL_INPUT_EOL. Standard for terminals is '\r', not '\n'. The other character out of
 * these two can or cannot be part of the copied line of text, see
 * #SERIAL_INPUT_FILTERED_CHAR. This, too, is a matter of compile time configuration.
 *   @return
 * This function returns \a str on success, and NULL on error or if not enough characters
 * have been received meanwhile to form a complete line of text.\n
 *   Note the special situation of a full receive buffer without having received any end of
 * line character. The system would be stuck - later received end of line characters would
 * be discarded becaus eof the full buffer and this function could never again return a
 * line of text. Therefore the function will return the complete buffer contents at once as
 * a line of input.
 *   @param str
 * This is the pointer to an array of chars where the C string is stored. \a str is the
 * empty string if the function returns NULL.
 *   @param sizeOfStr
 * The capacity of \a str in Byte. The maximum message length is one less since a
 * terminating zero character is always appended. A value of zero is caught by assertion.\n
 *   Note, if \a sizeOfStr is less than the line of text to be returned then the complete
 * line of text will nonetheless be removed from the receive buffer. Some characters from
 * the input stream would be lost.
 *   @remark
 * The serial interface is not restricted to text characters. If the source sends a zero
 * byte then this byte will be placed into the client's buffer \a str and it'll truncate
 * the message that is interpreted as C string.
 *   @remark
 * This function is a mixture of C lib's \a gets and \a fgets: Similar to \a gets it
 * doesn't put the end of line character into the result and similar to \a fgets it
 * respects the size of the receiving buffer.
 *   @remark 
 * Both, no data available yet and an empty input line of text return the same, empty C
 * string in \a str, but they differ in function return code, which is NULL or \a str,
 * respectively.
 *   @remark
 * On buffer overrun, i.e. if the client code didn't invoke this function fast enough, an
 * end of line won't be written into the internal receive buffer and the truncated line
 * will be silently concatenated with its successor. You may consider observing the global
 * variable \a sio_serialInLostBytes to recognize this situation. Note, because of the race
 * conditions between serial I/O interrupt and application software you can not clearly
 * relate a change of these variables to a particular message you get from this function.
 * In particular, you must not try to reset the counter prior to a read operation in order
 * to establish such a relation. Your application will just know that there is some garbled
 * input.
 */
char *sio_getLine(char str[], unsigned int sizeOfStr)
{
    if(sizeOfStr == 0)
    {
        assert(false);
        return NULL;
    }
    else
    {
        /* Reserve space for a terminating zero byte. */
        -- sizeOfStr;
    }
        
    char *result = &str[0]
       , *pWrApp = result;

    /* Reading the ring buffer is done in a critical section to ensure mutual exclusion
       with the it filling interrupt. */
    uint32_t msr = ihw_enterCriticalSection();
    {
        volatile uint8_t * pRd = _pRdSerialInRingBuf;

        /* If no line has been received then we need to double-check that the buffer is not
           entirely full; if so we were stuck: No new characters (i.e. no newline) could
           ever be received and the application would never again get a line of input.
             If we find a full buffer then we consider the entire buffer as a single line
           of input. */
        if(_serialInNoEOL == 0)
        {
            volatile uint8_t * const pWr = _pWrSerialInRingBuf
                           , * const pWrNext = pWr == _pEndSerialInRingBuf
                                               ? &_serialInRingBuf[0]
                                               : pWr + 1;
            if(pWrNext == pRd)
            {

